Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::RigidSegmentDefault Class Referencefinal
MEP Element Manager
The RigidSegmentDefault contains the necessary non-geometric data for creating a RigidSegment element. More...
#include <MEPRigidSegmentDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RigidSegmentDefault:
 Public Member Functions
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Result< ConnectorShape >  | GetShapeOfPort (uint32_t portIdx) const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Friends
 class  | RoutingSegment
 class  | RoutingSegmentDefault
 class  | RigidSegment
Result< RigidSegmentDefault >  | CreateRigidSegmentDefault (Domain)
Creates a RigidSegmentDefault.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Modifier (ElementDefault &)
Detailed Description
The RigidSegmentDefault contains the necessary non-geometric data for creating a RigidSegment element.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at RoutingElementDefault and RoutingSegmentDefault
Member Function Documentation
◆ GetHeight()
 double ACAPI::MEP::v1::RigidSegmentDefault::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the RigidSegment.
◆ GetShape()
 ConnectorShape ACAPI::MEP::v1::RigidSegmentDefault::GetShape  |  ( |   | ) |   const
Returns
Returns the shape of the RigidSegment.
◆ GetWidth()
 double ACAPI::MEP::v1::RigidSegmentDefault::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the RigidSegment.
Friends And Related Symbol Documentation
◆ CreateRigidSegmentDefault
 Result< RigidSegmentDefault > CreateRigidSegmentDefault  |  ( |  Domain  |  domain | )
friend
Creates a RigidSegmentDefault.
Parameters
domain | The Domain of the requested RigidSegmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the RigidSegment from the Routing tool for the domain defined by the parameter, otherwise Error.